# yolov8n_fruit_p2.yaml
# Optimized for small objects and fine details (Fruits)

# Parameters
nc: 2  # Warm vs Non-warm
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] 

# -----------------------------------------------------------------------
# BACKBONE (Standard YOLOv8n backbone)
# -----------------------------------------------------------------------
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4  <--- We need to connect to this later!
  - [-1, 3, C2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9

# -----------------------------------------------------------------------
# HEAD (Modified to include P2)
# -----------------------------------------------------------------------
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 cat backbone P4
  - [-1, 3, C2f, [512]]        # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13
  - [[-1, 4], 1, Concat, [1]]  # 14 cat backbone P3
  - [-1, 3, C2f, [256]]        # 15 (Original small object head)

  # --- NEW P2 BLOCKS START HERE ---
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16 (Upsample P3 to P2)
  - [[-1, 2], 1, Concat, [1]]  # 17 cat backbone P2 (Layer 2)
  - [-1, 3, C2f, [128]]        # 18 (New Tiny object head)
  # --- NEW P2 BLOCKS END HERE ---

  # Now we must downsample back up to complete the "loop" (PANet)
  - [-1, 1, Conv, [128, 3, 2]] # 19 (Down to P3)
  - [[-1, 15], 1, Concat, [1]] # 20 cat P3
  - [-1, 3, C2f, [256]]        # 21 (Final P3)

  - [-1, 1, Conv, [256, 3, 2]] # 22 (Down to P4)
  - [[-1, 12], 1, Concat, [1]] # 23 cat P4
  - [-1, 3, C2f, [512]]        # 24 (Final P4)

  - [-1, 1, Conv, [512, 3, 2]] # 25 (Down to P5)
  - [[-1, 9], 1, Concat, [1]]  # 26 cat P5
  - [-1, 3, C2f, [1024]]       # 27 (Final P5)

  # Detect on [P2, P3, P4, P5]
  # Note: Standard YOLO is [15, 18, 21]. We added a layer and shifted everything.
  # Our outputs are at layers: 18 (P2), 21 (P3), 24 (P4), 27 (P5)
  - [[18, 21, 24, 27], 1, Detect, [nc]]